<a href="https://colab.research.google.com/github/samp3209/leetcodeanswers/blob/main/SQL50.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Easy Problems

In [ ]:
# Write your MySQL query statement below
select product_id from Products where low_fats = 'Y' and recyclable = 'Y'

In [ ]:
# Write your MySQL query statement below
SELECT name from Customer where referee_id !=2 or referee_id is null

In [ ]:
# Write your MySQL query statement below
SELECT name, population, area from World where population >= 25000000 or area >= 3000000

In [ ]:
# Write your MySQL query statement below
select distinct author_id as id from Views where author_id = viewer_id order by author_id

In [ ]:
# Write your MySQL query statement below
SELECT tweet_id from Tweets where length(content) > 15

In [ ]:
# Write your MySQL query statement below
Select Employees.name, EmployeeUNI.unique_id from Employees left join EmployeeUNI on Employees.id = EmployeeUNI.id

In [ ]:
# Write your MySQL query statement below
SELECT Product.product_name, Sales.year, Sales.price FROM Sales left join Product on Sales.product_id = Product.product_id

In [ ]:
SELECT w1.id
FROM Weather w1, Weather w2
WHERE DATEDIFF(w1.recordDate, w2.recordDate) = 1 AND w1.temperature > w2.temperature;

In [ ]:
# Write your MySQL query statement below
SELECT * from Cinema where mod(id, 2) != 0 and description != 'boring' order by rating desc

In [ ]:
# Write your MySQL query statement below
select Prices.product_id, round(sum(units*price)/sum(units),2) as average_price from Prices inner join UnitsSold on Prices.product_id = UnitsSold.product_id and UnitsSold.purchase_date between start_date and end_date group by product_id

In [ ]:
# Write your MySQL query statement below
select project_id, round(sum(experience_years) / count(experience_years), 2) as average_years from Project p inner join Employee e on p.employee_id = e.employee_id group by p.project_id

In [ ]:
# Write your MySQL query statement below
select contest_id, round((count(distinct(user_id)) / (select count(user_id) from Users))*100,2) as percentage from Register GROUP BY contest_id order by percentage desc, contest_id

In [ ]:
# Write your MySQL query statement below
SELECT query_name, round(avg((rating / position)),2) as quality, round(AVG(if(rating < 3,1,0))*100,2) as poor_query_percentage FROM Queries Group By query_name

In [ ]:
SELECT teacher_id, count(distinct(subject_id)) as cnt from Teacher group by teacher_id

In [ ]:
# Write your MySQL query statement below
select activity_date as day, count(distinct(user_id))as active_users from Activity group by activity_date having count(distinct(activity_type)) > 2

In [ ]:
# Write your MySQL query statement below
SELECT class from Courses group by class having count(student) > 4

# Medium Problems

# Hard Problems